app/controllers/students_controller.rb

    def update
        set_student
        @student.update(student_params)
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "sobonkers"], ["updated_at", "2020-04-18 22:37:55.605875"], ["id", 4]]

    def set_student
        @student = Student.find_by_id(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]